## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |               RESOURCE               |
|--------|--------------------------------------|
| add    | `aws_alb_listener_rule.security_txt` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb_listener_rule.security_txt will be created
  + resource "aws_alb_listener_rule" "security_txt" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:915144821201:listener/app/idp-staging/75c403a9e3a7eb9d/00b5c0ded266e06e"
      + priority     = 1
      + region       = "ca-central-1"
      + tags         = {
          + "CostCentre" = "unified-accounts-staging"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "unified-accounts-staging"
          + "Terraform"  = "true"
        }

      + action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = <<-EOT
                    Contact: mailto:ZZTBSCYBERS@tbs-sct.gc.ca
                    Contact: https://hackerone.com/tbs-sct/
                    Canonical: https://cdssandbox.xyz/.well-known/security.txt
                    Expires: 2026-03-02T12:00:00.000Z
                    Preferred-Languages: en, fr
                EOT
              + status_code  = "200"
            }
        }

      + condition {
          + path_pattern {
              + regex_values = []
              + values       = [
                  + "/.well-known/security.txt",
                ]
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/idp_database/rds/locals.tf line 14, in locals:
  14:   region        = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 4 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.idp_ecs.aws_service_discovery_service.this,
  on .terraform/modules/idp_ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
